Reports/ЛБ_УсловияЗаймаВЛомбарде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_УсловияЗаймаВЛомбарде</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_ПрейскурантЦенНаМеталлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПрейскурантЦенНаМеталлы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПрейскурантПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПрейскурантПроцентныхСтавок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНачалаПрименения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_АкцииПроцентныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_АкцииПроцентныеСтавки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыПрейскурантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПрейскурантов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроцентныеСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ОтклонениеОтБазовойЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ОтклонениеОтБазовойЦены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Относительное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Абсолютное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_Ломбарды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Ломбарды</Name>
			<Comment>Ломбарды</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйФилиал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДневнойЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыйЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛомбарда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрефиксВНомереЗБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧисловой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемыКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ЛБ_УсловияЗаймаВЛомбарде/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ломбард") Тогда
		Отчет.Ломбард = Параметры.Ломбард;		
	КонецЕсли; 
	Если Параметры.Свойство("Дата") Тогда
		Отчет.Дата = Параметры.Дата;    
	Иначе
		Отчет.Дата = ТекущаяДата();
	КонецЕсли;  
	Отчет.ДатаНачалаДействия = Отчет.Дата; 
	
	Если ЗначениеЗаполнено(Отчет.Ломбард) Тогда
		СформироватьНаСервере();
	КонецЕсли;	
 КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Отчет.Ломбард) Тогда
		Сообщить("Не выбран ломбард!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()	
	ДокументРезультат.Очистить();   
	ДатаОтчета = ?(Отчет.Дата = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.Дата));                    
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ломбард", Отчет.Ломбард); 
	Запрос.УстановитьПараметр("Дата", ДатаОтчета); 
	Запрос.УстановитьПараметр("ДатаНачало", Отчет.ДатаНачалаДействия);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Период КАК Период,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Регистратор КАК Регистратор,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба.Владелец КАК Металл,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Проба КАК Проба,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Категория КАК Категория,
	               |	ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантЦенНаМеталлы.СрезПоследних(
	               |			&Дата,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаНачало) КАК ЛБ_ПрейскурантЦенНаМеталлыСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаМ = ТаблицаЗапроса.Скопировать();
	ТаблицаМ.Очистить();    
	СписокЛ = Новый СписокЗначений; 
	СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
	СписокЛ.Добавить(Отчет.Ломбард);
	ШаблонМеталлы = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаОтчета, Перечисления.ЛБ_ВидыПрейскурантов.Металлы, СписокЛ);
	Если ШаблонМеталлы = неопределено Тогда  
	 	Сообщить("На дату отчета не определен шаблон заполнения цен металлов!"); 
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
			Период = ТаблицаЗапроса.Получить(0).Период;
			Для каждого	Стр Из ТаблицаЗапроса Цикл
				Если Стр.Период < Период Тогда
					Прервать;
				КонецЕсли;
				СтрМ = ТаблицаМ.Добавить();
				СтрМ.Регистратор = Стр.Регистратор;
				СтрМ.Металл = Стр.Металл;
				СтрМ.Проба = Стр.Проба;
				СтрМ.Категория = Стр.Категория;
				СтрМ.Цена = Стр.Цена;
			КонецЦикла;	     
		КонецЕсли;
	Иначе
		Для каждого стрШ Из ШаблонМеталлы.Металлы Цикл
			СтрМ = ТаблицаМ.Добавить();
			СтрМ.Металл = СтрШ.Металл;
			СтрМ.Проба = СтрШ.Проба;
			СтрМ.Категория = СтрШ.КатегорияОбъектаЗалога;
		Конеццикла;	
		
		Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
			Период = ТаблицаЗапроса.Получить(0).Период;
			Для каждого	Стр Из ТаблицаЗапроса Цикл
				Если Стр.Период < Период Тогда
					Прервать;
				КонецЕсли; 
				ОтборМ = Новый Структура;
				ОтборМ.Вставить("Металл", Стр.Металл); 
				ОтборМ.Вставить("Проба", Стр.Проба);
				ОтборМ.Вставить("Категория", Стр.Категория);
				
				СтрокиМ = ТаблицаМ.НайтиСтроки(ОтборМ);
				Для каждого стрМ Из СтрокиМ Цикл
					СтрМ.Регистратор = Стр.Регистратор;
			    	СтрМ.Цена = Стр.Цена; 
				КонецЦикла;	
			КонецЦикла;	     
		КонецЕсли;
	КонецЕсли;	
	ТаблицаК = ТаблицаМ.Скопировать();
	ТаблицаК.Свернуть("Категория"); 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Период КАК Период,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.Регистратор КАК Регистратор,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ДиапазонСуммЗайма КАК ДиапазонСумм,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ДеньНачалаПрименения КАК ДеньНачалаПрименения,
	               |	ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних.ПроцентнаяСтавка КАК ПроцентнаяСтавка
	               |ИЗ
	               |	РегистрСведений.ЛБ_ПрейскурантПроцентныхСтавок.СрезПоследних(
	               |			&Дата,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаНачало) КАК ЛБ_ПрейскурантПроцентныхСтавокСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаС = ТаблицаЗапроса.Скопировать();
	ТаблицаС.Очистить();   
	ТаблицаСК = ТаблицаЗапроса.Скопировать();
	ТаблицаСК.Свернуть("Период, СхемаКредитования"); 
	ПериодСК = ТаблицаСК.Получить(0).Период; 
	Для каждого стрК Из ТаблицаСК Цикл 
		Если СтрК.Период < ПериодСК Тогда
			Прервать;
		КонецЕсли;	
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Период = Строки.Получить(0).Период;
        СписокЛ = Новый СписокЗначений; 
		СписокЛ.Добавить(Справочники.ЛБ_Ломбарды.ПустаяСсылка());
		СписокЛ.Добавить(Отчет.Ломбард);
		ШаблонПроцентныеСтавки = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблон(ДатаОтчета, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, СписокЛ, СтрК.СхемаКредитования);
		Если ШаблонПроцентныеСтавки = неопределено Тогда
            Сообщить("На дату отчета не определен шаблон заполнения процентных ставок для схемы кредитования " + СокрЛП(СтрК.СхемаКредитования) + "!");
			Для каждого	Стр Из Строки Цикл
				Если Стр.Период < Период Тогда
					Прервать;
				КонецЕсли;
				СтрС = ТаблицаС.Добавить();   
				СтрС.Регистратор = Стр.Регистратор;
				СтрС.СхемаКредитования = Стр.СхемаКредитования;
				СтрС.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
				СтрС.ДиапазонСумм = Стр.ДиапазонСумм;
				СтрС.ПроцентнаяСтавка = Стр.ПроцентнаяСтавка;
			КонецЦикла;
		Иначе
			Для каждого СтрШ Из ШаблонПроцентныеСтавки.СтавкиПроцентов Цикл 
				НоваяСтр = ТаблицаС.Добавить(); 
				НоваяСтр.СхемаКредитования = СтрК.СхемаКредитования;
				НоваяСтр.ПричинаПрименения = СтрШ.ПричинаПрименения;
				НоваяСтр.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
				НоваяСтр.ДиапазонСумм = СтрШ.ДиапазонСумм; 
				НоваяСтр.ДеньНачалаПрименения = СтрШ.ДеньНачалаПрименения;
			КонецЦикла;   
			
			Для каждого	Стр Из Строки Цикл
				Если Стр.Период < Период Тогда
					Прервать;
				КонецЕсли;     
				
				ОтборП = Новый Структура;
		        ОтборП.Вставить("СхемаКредитования", Стр.СхемаКредитования);
                ОтборП.Вставить("СтатусЗалогодателя", Стр.СтатусЗалогодателя);
				ОтборП.Вставить("ДиапазонСумм", Стр.ДиапазонСумм);
				ОтборП.Вставить("ПричинаПрименения", Стр.ПричинаПрименения);
				ОтборП.Вставить("ДеньНачалаПрименения", Стр.ДеньНачалаПрименения);

				СтрокиС = ТаблицаС.НайтиСтроки(ОтборП);  
				Для каждого стрС Из СтрокиС Цикл
					СтрС.Регистратор = Стр.Регистратор;
					СтрС.ПроцентнаяСтавка = Стр.ПроцентнаяСтавка;
				КонецЦикла;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	ТаблицаД = ТаблицаС.Скопировать();
	ТаблицаД.Свернуть("ДиапазонСумм");    
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Период КАК Период,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Регистратор КАК Регистратор,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Акция КАК Акция,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ДиапазонСуммЗайма КАК ДиапазонСумм,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.Отклонение КАК Отклонение,
	               |	ЛБ_АкцииПроцентныеСтавкиСрезПоследних.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	РегистрСведений.ЛБ_АкцииПроцентныеСтавки.СрезПоследних(
	               |			&Дата,
	               |			Ломбард = &Ломбард
	               |				И ДатаНачалаДействия <= &ДатаНачало
	               |				И ДатаОкончанияДействия >= &Дата) КАК ЛБ_АкцииПроцентныеСтавкиСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
	ТаблицаА = ТаблицаЗапроса.Скопировать();
	ТаблицаА.Свернуть("Акция");
	ТаблицаСА = ТаблицаЗапроса.Скопировать();
	ТаблицаСА.Очистить();   	
	Для каждого СтрА Из ТаблицаА Цикл   
		ШаблонПроцентныеСтавкиАкции = ЛБ_ОбщийМодуль.ПолучитьТекущийШаблонАкция(ДатаОтчета, Перечисления.ЛБ_ВидыПрейскурантов.ПроцентныеСтавки, СтрА.Акция); 
		Отбор = Новый Структура;
		Отбор.Вставить("Акция", СтрА.Акция);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Период = Строки.Получить(0).Период;

		Если ШаблонПроцентныеСтавкиАкции = неопределено Тогда  
		 	Сообщить("На дату отчета не определен шаблон заполнения процентных ставок по акции " + СокрЛП(СтрА.Акция) + "!"); 
			Для каждого	Стр Из Строки Цикл
				Если Стр.Период < Период Тогда
					Прервать;
				КонецЕсли;
				СтрС = ТаблицаСА.Добавить();   
				СтрС.Регистратор = Стр.Регистратор;
				СтрС.Акция = Стр.Акция;
				СтрС.СхемаКредитования = Стр.СхемаКредитования;
				СтрС.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
				СтрС.ДиапазонСумм = Стр.ДиапазонСумм;
				СтрС.ПроцентнаяСтавка = Стр.ПроцентнаяСтавка;
				СтрС.Отклонение = Стр.Отклонение;
				СтрС.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла; 
		Иначе  
			Для каждого СтрШ Из ШаблонПроцентныеСтавкиАкции.СтавкиПроцентов Цикл 
				НоваяСтр = ТаблицаСА.Добавить(); 
				НоваяСтр.Акция = СтрА.Акция;
				НоваяСтр.СхемаКредитования = СтрШ.СхемаКредитования;
				НоваяСтр.ПричинаПрименения = СтрШ.ПричинаПрименения;
				НоваяСтр.СтатусЗалогодателя = СтрШ.СтатусЗалогодателя;
				НоваяСтр.ДиапазонСумм = СтрШ.ДиапазонСумм;   
			КонецЦикла;   
			
			Для каждого	Стр Из Строки Цикл
				Если Стр.Период < Период Тогда
					Прервать;
				КонецЕсли;    
				
				ОтборП = Новый Структура;
		        ОтборП.Вставить("Акция", СтрА.Акция); 
				ОтборП.Вставить("СхемаКредитования", Стр.СхемаКредитования);
                ОтборП.Вставить("СтатусЗалогодателя", Стр.СтатусЗалогодателя);
				ОтборП.Вставить("ДиапазонСумм", Стр.ДиапазонСумм);
				ОтборП.Вставить("ПричинаПрименения", Стр.ПричинаПрименения);

				СтрокиС = ТаблицаСА.НайтиСтроки(ОтборП);  				
				Для каждого стрС Из СтрокиС Цикл
					СтрС.Регистратор = Стр.Регистратор;
					СтрС.ПроцентнаяСтавка = Стр.ПроцентнаяСтавка;
					СтрС.Отклонение = Стр.Отклонение;
					СтрС.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
				КонецЦикла;	
			КонецЦикла; 

		КонецЕсли;	
	КонецЦикла;		
	ТаблицаДА = ТаблицаСА.Скопировать();
	ТаблицаДА.Свернуть("ДиапазонСумм"); 

		
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Условия_Займа_В_Ломбарде";
	
	Макет 			 = Отчет.РеквизитМакет;
    ОбластьЗаголовок = Макет.ПолучитьОбласть("ШапкаОтчета"); 	
	ОбластьШапкаОсн  = Макет.ПолучитьОбласть("ШапкаОценкаДрагоценныхМеталлов|КолонкаОсновная");
	ОбластьШапкаДоп  = Макет.ПолучитьОбласть("ШапкаОценкаДрагоценныхМеталлов|КолонкаОценкаДрагоценныхМеталлов");
	ОбластьСтрокаОсн = Макет.ПолучитьОбласть("СтрокаОценкаДрагоценныеМеталлы|КолонкаОсновная"); 
	ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаОценкаДрагоценныеМеталлы|КолонкаОценкаДрагоценныхМеталлов");
	
	Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ОбластьЗаголовок.Параметры.ОрганизацияНаименование = СокрЛП(Организация);    
	ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес;  
	ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресОрганизации;
	ОбластьЗаголовок.Параметры.ОрганизацияАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, ВидКИ, Отчет.Дата);
	НомерЛ = СокрЛП(Отчет.Ломбард);
	Поз = Найти(НомерЛ, "№");
	Если НЕ Поз = 0 Тогда
		НомерЛ = СокрЛП(Сред(НомерЛ, Поз+1));
	КонецЕсли;	
	ОбластьЗаголовок.Параметры.ЛомбардНомер = НомерЛ; 
	ОбластьЗаголовок.Параметры.ОтчетДата = Формат(Отчет.Дата, "ДФ=dd.MM.yyyy");
	ДокументРезультат.Вывести(ОбластьЗаголовок); 
	
	Если НЕ ТаблицаМ.Количество() = 0 Тогда
		Регистратор = ТаблицаМ.Получить(0).Регистратор; 
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЛБ_ПриказУсловияПредоставленияЗаймов") Тогда
			ОбластьШапкаОсн.Параметры.Приказ = Регистратор;
		    ОбластьШапкаОсн.Параметры.ПоПриказу = "Приказ № " + СокрЛП(Регистратор.НомерПриказа) + " от " + Формат(Регистратор.Дата, "ДФ=dd.MM.yyyy"); 
		КонецЕсли;	
	КонецЕсли;	
	ДокументРезультат.Вывести(ОбластьШапкаОсн);
	Для каждого СтрК Из ТаблицаК Цикл   
		ОбластьШапкаДоп.Параметры.ОДМ_Категория = СтрК.Категория;
		ДокументРезультат.Присоединить(ОбластьШапкаДоп);
	Конеццикла;	  
	
	ТаблицаММ = ТаблицаМ.Скопировать();  
	ТаблицаММ.Свернуть("Металл, Проба");  
	ТаблицаММ.Сортировать("Металл, Проба Убыв");
	Для каждого СтрМ Из ТаблицаММ Цикл  
		ОбластьСтрокаОсн.Параметры.ОДМ_Металл = СтрМ.Металл; 
		ОбластьСтрокаОсн.Параметры.ОДМ_МеталлПроба = СтрМ.Проба;
		ДокументРезультат.Вывести(ОбластьСтрокаОсн);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Металл", СтрМ.Металл);
		Отбор.Вставить("Проба", СтрМ.Проба); 
		Для каждого СтрК Из ТаблицаК Цикл  
			Отбор.Вставить("Категория", СтрК.Категория); 
			Строки = ТаблицаМ.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда    
				Стр = Строки.Получить(0);
				ОбластьСтрокаДоп.Параметры.ОДМ_Цена = Стр.Цена;
				ДокументРезультат.Присоединить(ОбластьСтрокаДоп);
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;  
	
	ОбластьШапкаОсн  = Макет.ПолучитьОбласть("ШапкаПроцентныеСтавки|КолонкаОсновнаяПроценты"); 
	ОбластьШапкаДоп  = Макет.ПолучитьОбласть("ШапкаПроцентныеСтавки|КолонкаПроцентныеСтавки"); 
	ОбластьСтрокаОсн  = Макет.ПолучитьОбласть("СтрокаПроцентныеСтавки|КолонкаОсновнаяПроценты"); 
	ОбластьСтрокаДоп  = Макет.ПолучитьОбласть("СтрокаПроцентныеСтавки|КолонкаПроцентныеСтавки"); 
	
	Если НЕ ТаблицаС.Количество() = 0 Тогда 
		Регистратор = ТаблицаС.Получить(0).Регистратор;
		Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЛБ_ПриказУсловияПредоставленияЗаймов") Тогда
		    ОбластьШапкаОсн.Параметры.Приказ = Регистратор;
	        ОбластьШапкаОсн.Параметры.ПоПриказу = "Приказ № " + СокрЛП(Регистратор.НомерПриказа) + " от " + Формат(Регистратор.Дата, "ДФ=dd.MM.yyyy"); 
		КонецЕсли;	
	КонецЕсли;	
	ДокументРезультат.Вывести(ОбластьШапкаОсн);
	Для каждого СтрД Из ТаблицаД Цикл   
		ОбластьШапкаДоп.Параметры.ПС_ДиапазонСуммыЗайма = СтрД.ДиапазонСумм;
		ДокументРезультат.Присоединить(ОбластьШапкаДоп);
	Конеццикла;	  
	
	ТаблицаСС = ТаблицаС.Скопировать();  
	ТаблицаСС.Свернуть("СхемаКредитования, СтатусЗалогодателя, ДеньНачалаПрименения");
	Для каждого СтрС Из ТаблицаСС Цикл  
		ОбластьСтрокаОсн.Параметры.ПС_СхемаКредитования = СтрС.СхемаКредитования; 
		ОбластьСтрокаОсн.Параметры.ПС_СтатусКлиента = СтрС.СтатусЗалогодателя;
		ОбластьСтрокаОсн.Параметры.ПС_ДеньНачалаПрименения = СтрС.ДеньНачалаПрименения;
		ДокументРезультат.Вывести(ОбластьСтрокаОсн);
		
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", СтрС.СхемаКредитования);
		Отбор.Вставить("СтатусЗалогодателя", СтрС.СтатусЗалогодателя);
		Отбор.Вставить("ДеньНачалаПрименения", СтрС.ДеньНачалаПрименения); 
		Для каждого СтрД Из ТаблицаД Цикл  
			Отбор.Вставить("ДиапазонСумм", СтрД.ДиапазонСумм); 
			Строки = ТаблицаС.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда    
				Стр = Строки.Получить(0);
				ОбластьСтрокаДоп.Параметры.ПС_Ставка = Стр.ПроцентнаяСтавка;
				ДокументРезультат.Присоединить(ОбластьСтрокаДоп);
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;  
	
	ОбластьАкции  = Макет.ПолучитьОбласть("Акции"); 
	ОбластьПусто  = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьШапкаОсн  = Макет.ПолучитьОбласть("ШапкаПроцентныеСтавкиАкция|КолонкаОсновная"); 
	ОбластьШапкаДоп  = Макет.ПолучитьОбласть("ШапкаПроцентныеСтавкиАкция|КолонкаПроцентныеСтавки"); 
	ОбластьСтрокаОсн  = Макет.ПолучитьОбласть("СтрокаПроцентныеСтавкиАкция|КолонкаОсновная"); 
	ОбластьСтрокаДоп  = Макет.ПолучитьОбласть("СтрокаПроцентныеСтавкиАкция|КолонкаПроцентныеСтавки"); 
	
	ДокументРезультат.Вывести(ОбластьАкции);
	НомА = 0;
	Для каждого СтрА Из ТаблицаА Цикл  
		Если НЕ НомА = 0 Тогда 
			ДокументРезультат.Вывести(ОбластьПусто);
		Иначе
			НомА = НомА + 1;
		КонецЕсли;	
		ОтборА = Новый Структура;
		ОтборА.Вставить("Акция", СтрА.Акция);
        СтрокиА = ТаблицаСА.НайтиСтроки(ОтборА);
		Если НЕ СтрокиА.Количество() = 0 Тогда  
			ОбластьШапкаОсн.Параметры.Акция = СтрА.Акция;
			Регистратор = СтрокиА.Получить(0).Регистратор;
			Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ЛБ_ПриказУсловияПредоставленияЗаймов") Тогда
			    ОбластьШапкаОсн.Параметры.Приказ = Регистратор;
		        ОбластьШапкаОсн.Параметры.ПоПриказу = "Приказ № " + СокрЛП(Регистратор.НомерПриказа) + " от " + Формат(Регистратор.Дата, "ДФ=dd.MM.yyyy"); 
			КонецЕсли;	
		КонецЕсли;	
		ДокументРезультат.Вывести(ОбластьШапкаОсн);
		Для каждого СтрД Из ТаблицаДА Цикл   
			ОбластьШапкаДоп.Параметры.ПС_ДиапазонСуммыЗайма = СтрД.ДиапазонСумм;
			ДокументРезультат.Присоединить(ОбластьШапкаДоп);
		Конеццикла;	  
		
		ТаблицаСАА = ТаблицаСА.Скопировать();  
		ТаблицаСАА.Свернуть("Акция, СхемаКредитования, СтатусЗалогодателя");
		СтрокиСА = ТаблицаСАА.НайтиСтроки(ОтборА);
		Для каждого СтрС Из СтрокиСА Цикл  
			ОбластьСтрокаОсн.Параметры.ПС_СхемаКредитования = СтрС.СхемаКредитования; 
			ОбластьСтрокаОсн.Параметры.ПС_СтатусКлиента = СтрС.СтатусЗалогодателя;
			ДокументРезультат.Вывести(ОбластьСтрокаОсн);
			
			Отбор = Новый Структура; 
			Отбор.Вставить("Акция", СтрС.Акция);
			Отбор.Вставить("СхемаКредитования", СтрС.СхемаКредитования);
			Отбор.Вставить("СтатусЗалогодателя", СтрС.СтатусЗалогодателя); 
			Для каждого СтрД Из ТаблицаД Цикл  
				Отбор.Вставить("ДиапазонСумм", СтрД.ДиапазонСумм); 
				Строки = ТаблицаСА.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 Тогда    
					Стр = Строки.Получить(0); 
					Если НЕ Стр.ПроцентнаяСтавка = 0 Тогда
					    ОбластьСтрокаДоп.Параметры.ПС_Ставка = Стр.ПроцентнаяСтавка;
					ИначеЕсли НЕ Стр.ЗначениеОтклонения = 0 Тогда                         
						ОтборС = Новый Структура;
						Отбор.Вставить("СхемаКредитования", СтрС.СхемаКредитования);
			            Отбор.Вставить("СтатусЗалогодателя", СтрС.СтатусЗалогодателя); 
						СтрокиС = ТаблицаС.НайтиСтроки(ОтборС); 
						Если НЕ СтрокиС.Количество() = 0 Тогда
							СтрСС = СтрокиС.Получить(0); 
							Если НЕ СтрСС.ПроцентнаяСтавка = 0 Тогда  
								Если СтрСС.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное") Тогда 
									ОбластьСтрокаДоп.Параметры.ПС_Ставка = СтрСС.ПроцентнаяСтавка*(1+Стр.ЗначениеОтклонения/100); 
								ИначеЕсли СтрСС.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное") Тогда 
									ОбластьСтрокаДоп.Параметры.ПС_Ставка = СтрСС.ПроцентнаяСтавка + Стр.ЗначениеОтклонения;
								КонецЕсли;	
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	
					ДокументРезультат.Присоединить(ОбластьСтрокаДоп);
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;  
   КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Отчет.ДатаНачалаДействия = Отчет.Дата; 
КонецПроцедуры
